{"publicationId": "7e9b9ffe-e645-302d-9d94-517670623b35", "id": "1b073e57-3265-36e1-bdd4-241be6255755", "keywords": ["editors", "readers", "youre", "feedback", "feeling", "work", "know", "sick", "subject", "email", "outsick", "draft", "today", "ill"], "pubDate": null, "title": "An Editor’s Feedback on Your Out-Sick E-mail", "url": "https://www.newyorker.com/humor/daily-shouts/an-editors-feedback-on-your-out-sick-e-mail", "authors": ["Kerry Elson", "Kiki O Keeffe", "Ysabel Yates", "Peter Schjeldahl", "Dexter Filkins", "Jia Tolentino", "Michael Luo", "The New Yorker", "Briana Haynie"], "summary": "Subject: Out sickHi team,Apologies, but, unfortunately, I have to take a sick day today.\nSubject: Taking a sick dayHi everyone,I’m not feeling well, so I’ll be taking the day off to rest.\nI’ll be available on mobile and e-mail if needed, but please note that there may be a delay in my response.\nThese added sound effects will only work if you’re going to read the piece aloud.\nSubject: Sick todayI’m sick, so I’ll be staying home today.", "paragraphs": ["Subject: Think I’m getting sick", "Hi all,", "I feel like I might be coming down with something, so I should probably stay home.", "Good first draft, but the reader has to trust your narrative authority. You seem caught between two worlds—the world of the sick, and the world of the “well enough to go to work.” In your second draft, commit to a point of view.", "Subject: Out sick", "Hi team,", "Apologies, but, unfortunately, I have to take a sick day today. Sorry, again.", "The repetition of your apologies introduces doubt. Let’s be cognizant of subtext. Are you apologizing for being sick, or for something more nefarious, like not being sick?", "Subject: Taking a sick day", "Hi everyone,", "I’m not feeling well, so I’ll be taking the day off to rest. I’ll be available on mobile and e-mail if needed, but please note that there may be a delay in my response.", "Thank you for understanding.", "This draft is so lucid and coherent, it raises the question: Is this how a sick person sounds? This character is meant to be so ill as to be physically unable to attend work. In your next draft, plumb the depths of what that means. Show us a fight to communicate in the face of illness and despair.", "Subject: Me today", "All,", "Not feeling so good. Will be OOO.", "The conciseness here communicates a powerful sense of urgency, and there’s a lot that’s left off the page. Is it vomit? Diarrhea? Both? You leave us to wonder—an effective tool, no doubt. However, the directness comes across as aggressive. Remember, your goal is to convince your readers that you’re a sympathetic and approachable character.", "Subject: Tummy issues", "Heyy,", "My tum is achy and I tossed and turned all night :( Will be unavail.", "There is such a thing as a narrator that’s too sympathetic. When writing autobiographical prose, you must depict yourself as a complex human being, not a one-dimensional baby. Don’t court sympathy with tawdry tricks like frowny faces. Reveal the ugliness inside of you. Your readers will connect to your brave authenticity.", "Subject: [no subject]", "Been throwing up green bile all mroning and the back of my throat has that mucus-y sick taste. Won’t be in today. Will check in later.", "Bold choice with the absence of a subject line and greeting. Other writers couldn’t pull this off, but it works beautifully here. Also, the credibility typo is a nice detail. However, as a storyteller, your job is to package unsavory details into a narrative, not simply regurgitate them. One approach helps your readers understand sickness; the other just makes them sick. Tell your readers what they need to know: that you’re “under the weather.”", "Subject: [no subject]", "Hi team,", "I’m under the weather and won’t be in today.", "Hmm. I know I suggested “under the weather,” but, seeing it now in context, I don’t think it works. Also, on second thought, a subjectless subject line is over the top.", "Subject: Yikes", "Hi everyone,", "I just wanted to let you all (cough, cough) know that I am not feeling (achoo!) so well today and will be resting at home (blerp!).", "These added sound effects will only work if you’re going to read the piece aloud. You may not get the opportunity, so I urge you to write for the page.", "Subject: Me", "Colleagues,", "Here I lay", "On my bed", "I wish I could come today", "To help", "With the campaign, but", "I cannot because", "I threw up", "In my cup", "I’ve only seen one person get away with this, and it was Dorothy Parker.", "Subject: Sick today", "I’m sick, so I’ll be staying home today.", "This is a masterpiece—brava!"]}