{"id": "1f4aad01-43ec-323e-a8e9-86989cb0f3f2", "title": "Bushfire crisis expected to further sap confidence in the Australian economy", "url": "https://www.theguardian.com/australia-news/2020/jan/20/bushfire-crisis-expected-to-further-sap-confidence-in-the-australian-economy", "summary": "According to Deloitte Access Economics, the bushfire crisis is the latest in a string of bad news for the Australian economy, sapping consumer confidence along with the downturn in housing construction and prolonged drought.\nAnnouncing the $2bn bushfire package in January, Scott Morrison said that further funds would be provided, if required, but would not guarantee that the Coalition would achieve a surplus, forecast in December to be $5.6bn.\nAlthough there are 192,000 small businesses and sole traders in bushfire-affected areas, it is not yet known how many will be eligible for funding.\nThe government will also provide $3.5m for a small business bushfire financial support line and 10 additional financial counsellors.\nThe Council of Small Business Organisations of Australia’s chief executive, Peter Strong, said the “big surprise” in the announcement was the size of grants – up to $50,000 – which was more than the small business sector had asked for.", "paragraphs": ["Fires the latest in a string of bad economic news, Deloitte says, as government extends $2bn package to businesses", "Businesses damaged by bushfires will be eligible for additional grants of up to $50,000 in the latest pledge from the Morrison government’s $2bn disaster relief package.", "Businesses will also be able to access concessional loans of up to $500,000 if they have suffered significant loss of revenue or asset loss, opening the door to those indirectly affected by a business downturn rather than fire damage.", "The announcement on Monday responds to small business demands to boost cashflow after fires on the New South Wales south coast, in Victoria’s East Gippsland and on South Australia’s Kangaroo Island drove away tourists.", "According to Deloitte Access Economics, the bushfire crisis is the latest in a string of bad news for the Australian economy, sapping consumer confidence along with the downturn in housing construction and prolonged drought.", "Bushfire recovery: how is Australia's $2bn fund being spent? Read more", "In the latest business outlook report, released on Monday, Deloitte partly blames the Reserve Bank for its communication of the reasons driving recent rate cuts and warns that poor consumer and business confidence “risks becoming a self-fulfilling prophecy”.", "The report cites downturns in the retail, construction and finance sectors as cause for concern but notes healthcare, education and the public sector are growing.", "“Meantime insult is being added to injury for farmers, as bushfires join our deep drought: some of the workers leaving the land today may not return, as happened in the drought of the early 2000s and in the 2008 drought,” it said.", "Deloitte is still predicting two further rate cuts in 2020, but believes the Reserve Bank will not take the “big step” of quantitative easing, despite suggestions it could buy government bonds as a last resort if it runs out of levers to boost the economy when it drops the official interest rates to 0.25%.", "According to Deloitte, the federal budget has been hit by cyclical downswings in profits and wages but it believes the May budget will be propped up by a correction in the “very conservative” assumptions made about commodity prices in the December mid-year economic and fiscal update.", "Announcing the $2bn bushfire package in January, Scott Morrison said that further funds would be provided, if required, but would not guarantee that the Coalition would achieve a surplus, forecast in December to be $5.6bn.", "“The surplus is of no focus for me, what matters to me is the human cost and meeting whatever costs we need to meet,” he said.", "After consultation with business groups at a roundtable on Tuesday, the government announced its small business package, promising the program would be “demand-driven” but omitting its estimated cost because damage was still being assessed.", "Although there are 192,000 small businesses and sole traders in bushfire-affected areas, it is not yet known how many will be eligible for funding.", "The $50,000 tax-free grants will be provided under the disaster recovery funding arrangements, in addition to payments by state governments.", "Loans of up to $500,000 will be available for up to 10 years to restore or replace damaged assets and for working capital. Businesses will have a repayment holiday of two years interest free, with subsequent rates set at half the 10-year bond rate (currently 0.6%).", "The government will also provide $3.5m for a small business bushfire financial support line and 10 additional financial counsellors.", "The Council of Small Business Organisations of Australia’s chief executive, Peter Strong, said the “big surprise” in the announcement was the size of grants – up to $50,000 – which was more than the small business sector had asked for.", "Bushfire-destroyed homes should not be rebuilt in riskiest areas, experts say Read more", "“Obviously it’s got to have rules attached to it, to make sure it’s spent properly,” he told Guardian Australia.", "But Strong congratulated the government on its response, explaining it would help businesses with cashflow and where they had gaps or exclusions in their insurance coverage.", "“My understanding is businesses directly and indirectly affected, including those outside fire zones, will be eligible for loans.”", "Morrison said that “getting small businesses back on their feet is critical” and the government had listened to the advice of its leaders on the best forms of assistance.", "The treasurer, Josh Frydenberg, said small business was “the economic life blood of many of the affected areas” and the “comprehensive” response would support those impacted by fires.", "On Sunday the Morrison government announced a $76m tourism component of its $2bn bushfire relief fund, including $45m for global and domestic marketing campaigns, $10m for a regional tourism events initiative across bushfire-affected areas and $9.5m to host international media to promote tourism and trade."], "authors": ["Paul Karp"], "keywords": ["deloitte", "confidence", "businesses", "tourism", "bushfire", "latest", "sap", "crisis", "business", "2bn", "small", "australian", "expected", "south", "areas", "economy"], "pubDate": null, "publicationId": "c9a0e53b-93fe-38df-a6ea-4c8ff4501783"}