{"summary": "The streaming juggernaut has announced the release dates for their original programming through the month of February, and there's plenty of binge-worthy content.\nJanuary 8\"Cheer\" is a documentary series following a group of Novarro College cheerleaders as they prepare for the National Championship.\nThe series comes from the team that makes \"Last Chance U,\" a series following real-life junior college football players.\nJanuary 24NETFLIX SAYS MORE THAN 26 MILLION WATCHED 'THE IRISHMAN' IN 7 DAYSReunite with everyone's favorite teenage witch with \"The Chilling Adventures of Sabrina: Season 3.\"\nCLICK HERE TO GET THE FOX NEWS APPNetflix will also wrap up \"Better Call Saul\" with its fifth season.", "keywords": ["sabrina", "2020", "dates", "young", "second", "pursuit", "save", "season", "series", "netflix", "sex", "far", "release", "following", "shows", "know"], "paragraphs": ["This year has been a big one for Netflix, dominating the Golden Globe nominations and earning a handful of Emmys earlier this year -- but that doesn't mean they'll slow down in 2020.", "The streaming juggernaut has announced the release dates for their original programming through the month of February, and there's plenty of binge-worthy content.", "Here's a look at the release dates for Netflix's 2020 programming so far:", "6 CHRISTMAS MOVIES TO STREAM THIS SEASON", "January 1", "Kick off the new year with \"Messiah,\" a show following a CIA agent in her investigation of a man that gains a massive following through acts of public disturbance. Is he divine or dangerous?", "January 3", "\"Anne With an E\" returns for its third season, which will also be its last. The series is inspired by the classic novel \"Anne of Green Gables,\" the story of a young orphan growing up in the 19th century.", "January 8", "\"Cheer\" is a documentary series following a group of Novarro College cheerleaders as they prepare for the National Championship. The series comes from the team that makes \"Last Chance U,\" a series following real-life junior college football players.", "KEVIN HART ADDRESSES PAST SCANDALS IN TRAILER FOR DOCUSERIES", "January 10", "Join RuPaul to follow the story of a drag queen who recruits a child to help her regain $100,000 stolen from her through a rough-and-tumble cross-country adventure in \"AJ and the Queen.\"", "January 15", "For its penultimate season, \"Grace and Frankie\" will reunite fans with the titular entrepreneurs navigating their life after their husbands divorce them (for each other).", "January 17", "The second season of \"Sex Education\" will continue the story of a young man who sets up an underground sex therapy clinic at school, right under his teachers' noses.", "\"Ares\" will also debut, a horror series telling the story of two friends who open a portal to a demonic realm in pursuit of untold riches.", "January 24", "NETFLIX SAYS MORE THAN 26 MILLION WATCHED 'THE IRISHMAN' IN 7 DAYS", "Reunite with everyone's favorite teenage witch with \"The Chilling Adventures of Sabrina: Season 3.\" This time, Sabrina has to go through hell (literally) to save her boyfriend, Nick.", "January 31", "The second part of \"BoJack Horseman: Season 6\" will draw the story of a hard-drinking, foul-mouthed actor -- who is also a horse -- to a close.", "\"Ragnarok\" will tell the story of a small Scandanavian town facing irregular weather patterns that seem to indicate the impending apocalypse -- unless someone can save the day.", "February 7", "\"Locke and Key\" is based on graphic novels written by Stephen King's son Joe Hill, and follows three siblings who must fend off a monster in pursuit of magical keys belonging to their ancestral home.", "CLICK HERE TO GET THE FOX NEWS APP", "Netflix will also wrap up \"Better Call Saul\" with its fifth season. The series follows a skeevy criminal lawyer as he builds his reputation in the \"Breaking Bad\" spin-off."], "publicationId": "16476dca-59ce-395e-b896-050080120cd4", "url": "https://www.foxnews.com/entertainment/netflix-2020-shows-release-dates", "authors": ["Nate Day"], "id": "28847e86-3c48-302e-82b6-4b0acfba0b26", "pubDate": null, "title": "Netflix 2020 shows release dates: What we know so far"}